Sylvio84/ESP32MiniFramework/src/Managers/SystemManager.cpp
#include <Command.h>
#include "Managers/CommandManager.h"
#include "Managers/ConfigurationManager.h"
#include "Managers/DeviceManager.h"
#include <Devices/InternalLedDevice.h>
#include "Managers/EventManager.h"
#include "Managers/MQTTManager.h"
#include "Managers/SystemManager.h"
#include "Managers/TimeManager.h"
#include "Managers/WiFiManager.h"

#ifdef ESP8266
#include <ESP8266WiFi.h>
#endif

// Static constants
const char* SystemManager::RELEASE_VERSION = "1.2.2";
const char* SystemManager::RELEASE_DATE = "2025-08-30";

SystemManager::SystemManager(FrameworkContext& context) : Manager(context) {}

void SystemManager::init()
{
    debug("SystemManager init...", 1);

    // Get LED device from DeviceManager
    auto* ledDev = getLedDevice();
    if (ledDev) {
        // Initialize internal LED
        ledDev->setState(false);  // Start with LED off
    }

    // Initialize power saving and debug level from configuration
    auto* configMgr = static_cast<ConfigurationManager*>(context->getManager("ConfigurationManager"));
    if (configMgr) {
        setPowerSaving(configMgr->getPreference("power_saving", 10));
        debugLevel = configMgr->getPreference("debug_level", 0);
    }

    // Set initial CPU frequency for power efficiency
#ifdef ESP32
    setCpuFrequencyMhz(80);
#endif

    // Register commands with CommandManager
    registerCommands();

    setInitialized(true);
    if (ledDev) {
        ledDev->startBlinkPattern(50, 500);
    }
}

void SystemManager::loop()
{
    // LED blink pattern is now handled by InternalLedDevice's loop()

    // Handle power saving delay when conditions are met
    auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
    auto* mqttMgr = static_cast<MQTTManager*>(context->getManager("MQTTManager"));
    auto* timeMgr = static_cast<TimeManager*>(context->getManager("TimeManager"));

    if (wifiMgr && wifiMgr->isConnected() && mqttMgr && mqttMgr->isConnected() && timeMgr && timeMgr->isInitialized && powerSaving > 0) {
        delay(powerSaving);
    }
}


bool SystemManager::onEvent(const String& type, const String& event, const std::vector<String>& params)
{
    if (type == "wifi") {
        if (event == "connected" || event == "recovered") {
            // WiFi connected: slow blink (1s interval) for 3s max
            auto* ledDev = getLedDevice();
            if (ledDev) {
                ledDev->startBlinkPattern(500, 3000);
            }
            return false;  // Let other managers also handle this event
        }
    } else if (type == "mqtt") {
        if (event == "Connected") {
            // MQTT connected: fast blink (250ms interval) for 5s max
            auto* ledDev = getLedDevice();
            if (ledDev) {
                ledDev->startBlinkPattern(100, 5000);
            }
            return false;  // Let other managers also handle this event
        }
    } else if (type == "sys") {
        if (event.startsWith("@")) {
            // Handle system commands via events using CommandManager
            String command = event.substring(1);
            auto* cmdMgr = static_cast<CommandManager*>(context->getManager("CommandManager"));
            if (cmdMgr) {
                String result = cmdMgr->executeCommand("sys:" + command, params, CommandSource::Internal);
                if (!result.startsWith("Command not found")) {
                    debug("Command result: " + result, 2);
                    return true;
                }
            }
            return false;
        } else if (event == "power_saving_suspend") {
            clearPowerSavingResumeTimer();
            if (powerSaving > 0) {
                setPowerSaving(0, false);
                if (params.size() > 0) {
                    debug(params[0], 0);
                }
            }
            return true;

        } else if (event == "power_saving_resume") {
            clearPowerSavingResumeTimer();

            if (params.size() > 0) {
                auto* timeMgr = static_cast<TimeManager*>(context->getManager("TimeManager"));

                if (params.size() > 1 && isInteger(params[1]) && timeMgr) {
                    int duration = params[1].toInt() * 1000;
                    powerSavingResumeTimer = timeMgr->setTimeout(
                        [this, params] {
                            if (params[0].length() > 0) {
                                debug(params[0], 0);
                            }
                            setPowerSaving(-1, false);
                        },
                        duration);
                } else {
                    if (params[0].length() > 0) {
                        debug(params[0], 0);
                    }
                    setPowerSaving(-1, false);
                }
            } else {
                setPowerSaving(-1, false);
            }
            return true;
        }

    } else if (type == "espui") {
        if (event == "Command") {
            // Handle ESPUI commands via command system
            if (params.size() > 0) {
                auto* cmdMgr = static_cast<CommandManager*>(context->getManager("CommandManager"));
                if (cmdMgr) {
                    cmdMgr->executeCommand(params[0], {}, CommandSource::Web);
                    return true;
                }
            }
            return true;
        } else if (event == "Reboot") {
            debug("Restarting (espui event)...", 1);
            restartSystem();
            return true;
        }

    } else if (type == "serial") {
        if (event == "input") {
            // Forward to input processing - this needs to be handled by MainController
            return false;  // Let MainController handle this
        } else if (event == "command") {
            // Forward serial commands to ESPUI
            context->getEventManager()->triggerEvent("espui", "SerialIn", params);
            return true;
        }

    } else if (type == "telnet") {
        if (event == "input") {
            // Forward to input processing - this needs to be handled by MainController
            return false;  // Let MainController handle this
        }
    }

    return false;  // Event not handled
}

