Sylvio84/ESP32MiniFramework/src/Managers/SystemManager.cpp
// === Internal LED Control ===

InternalLedDevice* SystemManager::getLedDevice()
{
    if (!ledDevice) {
        auto* devMgr = static_cast<DeviceManager*>(context->getManager("DeviceManager"));
        if (devMgr) {
            Device* dev = devMgr->getDeviceById("led");
            if (dev) {
                ledDevice = static_cast<InternalLedDevice*>(dev);
            }
        }
    }
    return ledDevice;
}

// === System Information ===

void SystemManager::showSystemInfo()
{
    debug("ESP32 Mini Framework Version: " + String(RELEASE_VERSION) + " (" + String(RELEASE_DATE) + ")", 0);
    debug("Frequency: " + String(ESP.getCpuFreqMHz()) + " MHz", 0);

#ifdef ESP32
    debug("Total Heap: " + String(ESP.getHeapSize() / 1024) + " KB", 0);
#endif
    debug("Free Heap: " + String(ESP.getFreeHeap() / 1024) + " KB", 0);
    debug("Flash size: " + String(ESP.getFlashChipSize() / 1024) + " KB", 0);
    debug("Sketch size: " + String(ESP.getSketchSize() / 1024) + " KB", 0);
    debug("Free sketch space: " + String(ESP.getFreeSketchSpace() / 1024) + " KB", 0);

#ifdef ESP32
    debug("Chip ID: " + String(ESP.getEfuseMac()), 0);
    debug("Chip model: " + String(ESP.getChipModel()), 0);
    debug("Chip revision: " + String(ESP.getChipRevision()), 0);
    debug("Chip core: " + String(ESP.getChipCores()), 0);
#endif

#ifdef ESP8266
    debug("Reset reason: " + ESP.getResetReason(), 0);
    // Additional memory monitoring for ESP8266
    debug("Heap Fragmentation: " + String(ESP.getHeapFragmentation()) + "%", 0);
    debug("Max Free Block: " + String(ESP.getMaxFreeBlockSize()) + " bytes", 0);
    debug("Free Cont Stack: " + String(ESP.getFreeContStack()) + " bytes", 0);
#endif

    // Get information from other managers
    auto* configMgr = static_cast<ConfigurationManager*>(context->getManager("ConfigurationManager"));
    if (configMgr) {
        debug("Hostname: " + configMgr->getHostname(), 0);
    }
    debug("Debug level: " + String(debugLevel), 0);
    debug("Power saving time: " + String(powerSaving), 0);

    auto* timeMgr = static_cast<TimeManager*>(context->getManager("TimeManager"));
    if (timeMgr) {
        debug("Time: " + timeMgr->getFormattedDateTime("%d/%m/%Y %H:%M:%S"), 0);
    }

    auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
    if (wifiMgr) {
        if (wifiMgr->isConnected()) {
            debug("Connected to WiFi: " + wifiMgr->retrieveSSID(), 0);
            debug("IP address: " + wifiMgr->retrieveIP(), 0);
        } else {
            debug("Not connected to WiFi", 0);
        }
    }

    auto* mqttMgr = static_cast<MQTTManager*>(context->getManager("MQTTManager"));
    if (mqttMgr) {
        if (mqttMgr->isConnected()) {
            debug("Connected to MQTT server: " + mqttMgr->retrieveServer(), 0);
        } else {
            debug("Not connected to MQTT server", 0);
        }
    }

#ifdef ESP8266
    debug("Power saving: " + String(wifi_get_sleep_type() == NONE_SLEEP_T ? "disabled" : "enabled"), 0);
#endif
}

String SystemManager::getSystemInfo()
{
    String info = "";
    info += "ESP32 Mini Framework Version: " + String(RELEASE_VERSION) + " (" + String(RELEASE_DATE) + ")\n";
    info += "Frequency: " + String(ESP.getCpuFreqMHz()) + " MHz\n";

#ifdef ESP32
    info += "Total Heap: " + String(ESP.getHeapSize() / 1024) + " KB\n";
#endif
    info += "Free Heap: " + String(ESP.getFreeHeap()) + " / " + String(ESP.getFreeHeap() / 1024) + " KB\n";
    info += "Flash size: " + String(ESP.getFlashChipSize() / 1024) + " KB\n";
    info += "Sketch size: " + String(ESP.getSketchSize() / 1024) + " KB\n";
    info += "Free sketch space: " + String(ESP.getFreeSketchSpace() / 1024) + " KB\n";

#ifdef ESP32
    info += "Chip ID: " + String(ESP.getEfuseMac()) + "\n";
    info += "Chip model: " + String(ESP.getChipModel()) + "\n";
    info += "Chip revision: " + String(ESP.getChipRevision()) + "\n";
    info += "Chip cores: " + String(ESP.getChipCores()) + "\n";
#endif

#ifdef ESP8266
    info += "Reset reason: " + ESP.getResetReason() + "\n";
    // Additional memory monitoring for ESP8266
    info += "Heap Fragmentation: " + String(ESP.getHeapFragmentation()) + "%\n";
    info += "Max Free Block Size: " + String(ESP.getMaxFreeBlockSize()) + " bytes\n";
    info += "Free Cont Stack: " + String(ESP.getFreeContStack()) + " bytes\n";
    
    // Flash information
    uint32_t realSize = ESP.getFlashChipRealSize();
    uint32_t ideSize = ESP.getFlashChipSize();
    if (realSize != ideSize) {
        info += "Flash Real Size: " + String(realSize / 1024) + " KB\n";
        info += "Flash IDE Size: " + String(ideSize / 1024) + " KB (mismatch!)\n";
    }
#endif

    // Get information from other managers
    auto* configMgr = static_cast<ConfigurationManager*>(context->getManager("ConfigurationManager"));
    if (configMgr) {
        info += "Hostname: " + configMgr->getHostname() + "\n";
    }
    info += "Debug level: " + String(debugLevel) + "\n";
    info += "Power saving time: " + String(powerSaving) + "\n";

    auto* timeMgr = static_cast<TimeManager*>(context->getManager("TimeManager"));
    if (timeMgr) {
        info += "Time: " + timeMgr->getFormattedDateTime("%d/%m/%Y %H:%M:%S") + "\n";
    }

    auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
    if (wifiMgr) {
        if (wifiMgr->isConnected()) {
            info += "Connected to WiFi: " + wifiMgr->retrieveSSID() + "\n";
            info += "IP address: " + wifiMgr->retrieveIP() + "\n";
        } else {
            info += "Not connected to WiFi\n";
        }
    }

    auto* mqttMgr = static_cast<MQTTManager*>(context->getManager("MQTTManager"));
    if (mqttMgr) {
        if (mqttMgr->isConnected()) {
            info += "Connected to MQTT server: " + mqttMgr->retrieveServer() + "\n";
        } else {
            info += "Not connected to MQTT server\n";
        }
    }

#ifdef ESP8266
    info += "Power saving: " + String(wifi_get_sleep_type() == NONE_SLEEP_T ? "disabled" : "enabled") + "\n";
#endif

    // Remove trailing newline
    if (info.endsWith("\n")) {
        info.remove(info.length() - 1);
    }

    return info;
}

