Sylvio84/ESP32MiniFramework/src/Managers/SystemManager.cpp
void SystemManager::showFilesystemInfo()
{
    if (!LittleFS.begin()) {
        debug("Failed to initialize LittleFS", 0);
        return;
    }

#ifdef ESP8266
    FSInfo fs_info;
    LittleFS.info(fs_info);
    size_t totalBytes = fs_info.totalBytes;
    size_t usedBytes = fs_info.usedBytes;
#endif

#ifdef ESP32
    size_t totalBytes = LittleFS.totalBytes();
    size_t usedBytes = LittleFS.usedBytes();
#endif

    debug("Total bytes: " + String(totalBytes), 0);
    debug("Used bytes: " + String(usedBytes), 0);
    debug("Free bytes: " + String(totalBytes - usedBytes), 0);
}

String SystemManager::getFilesystemInfo()
{
    if (!LittleFS.begin()) {
        return "Failed to initialize LittleFS";
    }

#ifdef ESP8266
    FSInfo fs_info;
    LittleFS.info(fs_info);
    size_t totalBytes = fs_info.totalBytes;
    size_t usedBytes = fs_info.usedBytes;
#endif

#ifdef ESP32
    size_t totalBytes = LittleFS.totalBytes();
    size_t usedBytes = LittleFS.usedBytes();
#endif

    String info = "";
    info += "Total bytes: " + String(totalBytes) + "\n";
    info += "Used bytes: " + String(usedBytes) + "\n";
    info += "Free bytes: " + String(totalBytes - usedBytes);

    return info;
}

// === CPU Control ===

void SystemManager::setCpuFrequency(int frequency)
{
#ifdef ESP32
    setCpuFrequencyMhz(frequency);
#endif
}

int SystemManager::getCpuFrequency()
{
    return ESP.getCpuFreqMHz();
}

float SystemManager::getCpuTemperature()
{
#ifdef ESP32
    return temperatureRead();
#else
    return 0.0;
#endif
}

// === System Control ===

void SystemManager::restartSystem()
{
    ESP.restart();
}

void SystemManager::performOtaUpdate()
{
    // clear commands
    auto* cmdMgr = static_cast<CommandManager*>(context->getManager("CommandManager"));
    if (cmdMgr) {
        cmdMgr->clearCommands();
    }

    // disconnect MQTT
    auto* mqttMgr = static_cast<MQTTManager*>(context->getManager("MQTTManager"));
    if (mqttMgr && mqttMgr->isConnected()) {
        mqttMgr->disconnect();
    }

    auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
    if (wifiMgr) {
        wifiMgr->otaUpdate();
    } else {
        debug("WiFiManager not available for OTA update", 0);
    }
}

// === Power Management ===

void SystemManager::setPowerSaving(int value, bool save)
{
    auto* configMgr = static_cast<ConfigurationManager*>(context->getManager("ConfigurationManager"));
    auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));

    if (value < 0) {
        value = configMgr ? configMgr->getPreference("power_saving", 0) : 0;
    }
    if (value == 1) {
        value = 100;  // default value
    }

    powerSaving = value;

    if (powerSaving > 0) {
        debug("Power saving enabled: process every " + String(powerSaving) + "ms", 1);
        if (wifiMgr) {
            wifiMgr->setPowerSave(true);
        }
    } else {
        if (save) {
            debug("Power saving disabled", 1);
        } else {
            debug("Power saving suspended", 3);
        }
        if (wifiMgr) {
            wifiMgr->setPowerSave(false);
        }
    }

    if (save && configMgr) {
        configMgr->setPreference("power_saving", powerSaving);
    }
}

void SystemManager::clearPowerSavingResumeTimer()
{
    auto* timeMgr = static_cast<TimeManager*>(context->getManager("TimeManager"));
    if (timeMgr && powerSavingResumeTimer > 0) {
        timeMgr->clearTimeout(powerSavingResumeTimer);
        powerSavingResumeTimer = 0;
    }
}

// === Debug Level Management ===

void SystemManager::setDebugLevel(int level, bool save)
{
    debugLevel = level;
    debug("Debug level set to: " + String(debugLevel), 1);
    
    if (save) {
        auto* configMgr = static_cast<ConfigurationManager*>(context->getManager("ConfigurationManager"));
        if (configMgr) {
            configMgr->setPreference("debug_level", debugLevel);
        }
    }
}

// === Command Registration ===

void SystemManager::registerCommands()
{
    auto* cmdMgr = static_cast<CommandManager*>(context->getManager("CommandManager"));
    if (!cmdMgr) {
        debug("CommandManager not available for command registration", 1);
        return;
    }

    // Version command
    cmdMgr->registerCommand(Command("sys", "version", "Framework version", CommandSource::Any, true, [this](const std::vector<String>& args) {
        return "Version: " + String(RELEASE_VERSION) + " (" + String(RELEASE_DATE) + ")";
    }));

    #ifndef ESP8266
    // Uptime command
    cmdMgr->registerCommand(Command("sys", "uptime", "System uptime", CommandSource::Any, true,
                                    [this](const std::vector<String>& args) { return "Uptime: " + String(millis() / 1000) + " seconds"; }));

    // Echo command
    cmdMgr->registerCommand(Command("sys", "echo", "Echo back the provided text", CommandSource::Any, true, [this](const std::vector<String>& args) {
        if (args.size() == 0) {
            return String("");
        }
        String result = "";
        for (size_t i = 0; i < args.size(); i++) {
            if (i > 0)
                result += " ";
            result += args[i];
        }
        return result;
    }));

    // Temperature command
    cmdMgr->registerCommand(Command("sys", "temp", "CPU temp.", CommandSource::Any, true, [this](const std::vector<String>& args) {
        float temp = getCpuTemperature();
        return "Temperature: " + String(temp) + "°C";
    }));

    // LED command - now delegates to InternalLedDevice
    cmdMgr->registerCommand(Command("sys", "led", "Control internal LED (on/off)", CommandSource::Any, true, [this](const std::vector<String>& args) -> String {
        auto* ledDev = getLedDevice();
        if (!ledDev) {
            return String("LED device not available");
        }

        if (args.size() > 0) {
            if (args[0] == "on") {
                ledDev->setState(true);
                return String("LED on");
            } else if (args[0] == "off") {
                ledDev->setState(false);
                return String("LED off");
            } else {
                return String("Invalid parameter. Usage: led on|off");
            }
        } else {
            return String("LED state: " + String(ledDev->isOn() ? "on" : "off"));
        }
    }));

