Sylvio84/ESP32MiniFramework/src/Managers/SystemManager.cpp
    // CPU Frequency command
    cmdMgr->registerCommand(
        Command("sys", "freq", "Get/Set CPU frequency (80/160/240 MHz)", CommandSource::Any, true, [this](const std::vector<String>& args) -> String {
            if (args.size() > 0) {
                int freq = args[0].toInt();
                if (freq == 80 || freq == 160 || freq == 240) {
                    if (freq == 240 && ESP.getChipModel() == "ESP32C3") {
                        return String("240 MHz frequency not supported on ESP32-C3");
                    }
                    setCpuFrequency(freq);
                    return String("Frequency set to: " + String(freq) + " MHz");
                } else {
                    return String("Invalid frequency. Valid: 80, 160, 240 MHz");
                }
            } else {
                int freq = getCpuFrequency();
                return String("CPU Frequency: " + String(freq) + " MHz");
            }
        }));

    // Filesystem info command
    cmdMgr->registerCommand(Command("sys", "fs", "Filesystem info", CommandSource::Any, true,
                                    [this](const std::vector<String>& args) -> String { return getFilesystemInfo(); }));

    #endif

    // System info command
    cmdMgr->registerCommand(Command("sys", "info", "System info", CommandSource::Any, true,
                                    [this](const std::vector<String>& args) -> String { return getSystemInfo(); }));

    // Restart command
    cmdMgr->registerCommand(Command("sys", "restart", "Reboot", CommandSource::Any, true,  // Enable history for restart
                                    [this](const std::vector<String>& args) -> String {
                                        debug("Restarting system...", 1);
                                        delay(500);
                                        restartSystem();
                                        return String("Restarting...");
                                    }));

    // Reboot alias
    cmdMgr->registerAlias("reboot", "sys:restart");

    // OTA Update command
    cmdMgr->registerCommand(Command("sys", "ota", "OTA FW update",
                                    CommandSource::Serial,  // Only from Serial for security
                                    true,                   // Enable history
                                    [this](const std::vector<String>& args) -> String {
                                        debug("Starting OTA update...", 1);
                                        performOtaUpdate();
                                        return String("OTA update started");
                                    }));

    // WiFi configuration commands
    cmdMgr->registerCommand(Command("wifi", "ssid", "Get/Set WiFi SSID", CommandSource::Any, true, [this](const std::vector<String>& args) -> String {
        auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
        if (!wifiMgr) {
            return String("WiFiManager not available");
        }

        if (args.size() > 0) {
            // Set SSID
            wifiMgr->saveSSID(args[0], false);
            return String("WiFi SSID saved: " + args[0]);
        } else {
            // Get SSID
            String ssid = wifiMgr->retrieveSSID();
            if (ssid.isEmpty()) {
                return String("WiFi SSID: (not set)");
            } else {
                return String("WiFi SSID: " + ssid);
            }
        }
    }));

    cmdMgr->registerCommand(Command("wifi", "pass", "Get/Set WiFi password", CommandSource::Any, true, [this](const std::vector<String>& args) -> String {
        auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
        if (!wifiMgr) {
            return String("WiFiManager not available");
        }

        if (args.size() > 0) {
            // Set password
            wifiMgr->savePassword(args[0], false);
            return String("WiFi password saved");
        } else {
            // Get password (masked for security)
            String pass = wifiMgr->retrievePassword();
            if (pass.isEmpty()) {
                return String("WiFi password: (not set)");
            } else {
                return String("WiFi password: ****");
            }
        }
    }));

    cmdMgr->registerCommand(
        Command("wifi", "connect", "Connect to WiFi", CommandSource::Any, true, [this](const std::vector<String>& args) -> String {
            auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
            if (!wifiMgr) {
                return String("WiFiManager not available");
            }

            wifiMgr->autoConnect();
            return String("WiFi connection initiated");
        }));

    cmdMgr->registerCommand(
        Command("wifi", "status", "WiFi conn. status", CommandSource::Any, true, [this](const std::vector<String>& args) -> String {
            auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
            if (!wifiMgr) {
                return String("WiFiManager not available");
            }

            String result = "WiFi Status:\n";
            result += "  Connected: " + String(wifiMgr->isConnected() ? "Yes" : "No") + "\n";
            result += "  SSID: " + wifiMgr->retrieveSSID() + "\n";
            result += "  Status: " + wifiMgr->getStatus() + "\n";
            if (wifiMgr->isConnected()) {
                result += "  IP: " + wifiMgr->retrieveIP();
            }
            return result;
        }));

    // Debug level command
    cmdMgr->registerCommand(Command("sys", "debug", "Get/Set debug level (0-3)", CommandSource::Any, true, 
        [this](const std::vector<String>& args) -> String {
            if (args.size() > 0) {
                int level = args[0].toInt();
                if (level >= 0 && level <= 9) {
                    setDebugLevel(level);
                    return String("Debug level set to: " + String(level));
                } else {
                    return String("Invalid debug level. Valid range: 0-9");
                }
            } else {
                return String("Debug level: " + String(debugLevel));
            }
        }));

    /*cmdMgr->registerCommand(Command("sys", "clearmem", "Clear memory caches and perform garbage collection", CommandSource::Any, true,
       [this](const std::vector<String>& args) -> String {
           // Clear MQTT subscriptions history if too large
           auto* mqttMgr = static_cast<MQTTManager*>(context->getManager("MQTTManager"));
           if (mqttMgr) {
               // Clear retained publications not needed
               std::vector<String> subs = mqttMgr->getSubscriptions();
               for (const auto& sub : subs) {
                   mqttMgr->removePublication(sub);
               }
           }
           
           // Clear event manager callbacks that are no longer needed
           //auto* evtMgr = static_cast<EventManager*>(context->getManager("EventManager"));
           
           // Force String pool cleanup
           #ifdef ESP8266
           // ESP8266 specific memory cleanup
           ESP.wdtFeed();
           yield();
           #elif defined(ESP32)
           // ESP32 specific cleanup
           heap_caps_malloc_extmem_enable(0);
           #endif
           
           // Report memory status
           size_t freeBefore = ESP.getFreeHeap();
           
           // Return memory status
           return "Memory cleaned. Free heap: " + String(freeBefore) + " bytes";
       }
    ));*/
}